Repository: zziri/cmux
Catalog: Resources/Localizable.xcstrings
Source language: en
Languages: ar, bs, da, de, es, fr, it, ja, ko, nb, pl, pt_br, ru, th, tr, uk, zh_hans, zh_hant

# cli.rightSidebar.usage
source: Usage: cmux right-sidebar <command> [flags] Control the right sidebar from the CLI. Commands: toggle Toggle right sidebar visibility show Show the right sidebar hide Hide the right sidebar focus Focus the current right sidebar mode set <files|find|vault|sessions|feed|dock|cloud|custom> [sidebar-name] Show, switch mode, and focus. `custom` renders a JS/Swift sidebar from ~/.config/cmux/sidebars as a right panel; the optional name picks which one. mode Print {"visible":bool,"mode":string} files|find|vault|sessions|feed|dock|cloud|custom Alias for show + set + focus Flags: --workspace <id|ref|index> Target the window containing a workspace --window <id|ref|index> Target a window --no-focus With set, switch mode without moving focus Examples: cmux right-sidebar toggle cmux right-sidebar set find cmux right-sidebar set vault --no-focus cmux right-sidebar mode
ar: الاستخدام: cmux right-sidebar <command> [flags] التحكم في الشريط الجانبي الأيمن من واجهة CLI. الأوامر: toggle تبديل رؤية الشريط الجانبي الأيمن show إظهار الشريط الجانبي الأيمن hide إخفاء الشريط الجانبي الأيمن focus تركيز وضع الشريط الجانبي الأيمن الحالي set <files|find|vault|sessions|feed|dock|cloud|custom> [sidebar-name] إظهار، وتبديل الوضع، والتركيز. يقوم `custom` بتقديم شريط جانبي JS/Swift من ~/.config/cmux/sidebars كـ لوحة يمنى؛ ويحدد الاسم الاختياري أيًا منها. mode طباعة {"visible":bool,"mode":string} files|find|vault|sessions|feed|dock|cloud|custom اسم مستعار لـ show + set + focus الأعلام: --workspace <id|ref|index> استهداف النافذة التي تحتوي على مساحة عمل --window <id|ref|index> استهداف نافذة --no-focus مع أمر set، يتم تبديل الوضع دون نقل التركيز أمثلة: cmux right-sidebar toggle cmux right-sidebar set find cmux right-sidebar set vault --no-focus cmux right-sidebar mode
de: Verwendung: cmux right-sidebar <Befehl> [Flags] Steuern Sie die rechte Seitenleiste über die CLI. Befehle: toggle Sichtbarkeit der rechten Seitenleiste umschalten show Die rechte Seitenleiste anzeigen hide Die rechte Seitenleiste ausblenden focus Den aktuellen Modus der rechten Seitenleiste fokussieren set <files|find|vault|sessions|feed|dock|cloud|custom> [Seitenleisten-Name] Anzeigen, Modus wechseln und fokussieren. `custom` rendert eine JS/Swift-Seitenleiste aus ~/.config/cmux/sidebars als rechtes Panel; der optionale Name wählt aus, welche. mode {"visible":bool,"mode":string} ausgeben files|find|vault|sessions|feed|dock|cloud|custom Alias für show + set + focus Flags: --workspace <id|ref|index> Zielt auf das Fenster ab, das einen Arbeitsbereich enthält --window <id|ref|index> Zielt auf ein Fenster ab --no-focus Mit set den Modus wechseln, ohne den Fokus zu verschieben Beispiele: cmux right-sidebar toggle cmux right-sidebar set find cmux right-sidebar set vault --no-focus cmux right-sidebar mode
es: Uso: cmux right-sidebar <command> [flags] Controlar la barra lateral derecha desde la CLI. Comandos: toggle Alternar la visibilidad de la barra lateral derecha show Mostrar la barra lateral derecha hide Ocultar la barra lateral derecha focus Enfocar el modo actual de la barra lateral derecha set <files|find|vault|sessions|feed|dock|cloud|custom> [sidebar-name] Mostrar, cambiar de modo y enfocar. `custom` renderiza una barra lateral JS/Swift de ~/.config/cmux/sidebars como un panel derecho; el nombre opcional elige cuál. mode Imprimir {"visible":bool,"mode":string} files|find|vault|sessions|feed|dock|cloud|custom Alias para show + set + focus Opciones: --workspace <id|ref|index> Apuntar a la ventana que contiene un espacio de trabajo --window <id|ref|index> Apuntar a una ventana --no-focus Con set, cambiar de modo sin mover el foco Ejemplos: cmux right-sidebar toggle cmux right-sidebar set find cmux right-sidebar set vault --no-focus cmux right-sidebar mode
fr: Utilisation : cmux right-sidebar <commande> [options] Contrôler la barre latérale droite depuis l'interface en ligne de commande. Commandes : toggle Basculer la visibilité de la barre latérale droite show Afficher la barre latérale droite hide Masquer la barre latérale droite focus Donner le focus au mode actuel de la barre latérale droite set <files|find|vault|sessions|feed|dock|cloud|custom> [nom-barre-latérale] Afficher, changer de mode et donner le focus. `custom` affiche une barre latérale JS/Swift depuis ~/.config/cmux/sidebars sous forme de panneau droit ; le nom optionnel permet de choisir laquelle. mode Afficher {"visible":bool,"mode":string} files|find|vault|sessions|feed|dock|cloud|custom Alias pour show + set + focus Options : --workspace <id|ref|index> Cibler la fenêtre contenant un espace de travail --window <id|ref|index> Cibler une fenêtre --no-focus Avec set, changer de mode sans déplacer le focus Exemples : cmux right-sidebar toggle cmux right-sidebar set find cmux right-sidebar set vault --no-focus cmux right-sidebar mode
ja: 使用法: cmux right-sidebar <command> [flags] CLI から右サイドバーを操作します。 コマンド: toggle 右サイドバーの表示を切り替えます show 右サイドバーを表示します hide 右サイドバーを隠します focus 現在の右サイドバーモードにフォーカスします set <files|find|vault|sessions|feed|dock|cloud|custom> [sidebar-name] 表示して、モードを切り替え、フォーカスします。custom は ~/.config/cmux/sidebars の JS/Swift サイドバーを右パネルに 表示します（名前で選択できます） mode {"visible":bool,"mode":string} を出力します files|find|vault|sessions|feed|dock|cloud|custom show + set + focus のエイリアス フラグ: --workspace <id|ref|index> ワークスペースを含むウィンドウを対象にします --window <id|ref|index> ウィンドウを対象にします --no-focus set で、フォーカスを移さずにモードだけ切り替えます 例: cmux right-sidebar toggle cmux right-sidebar set find cmux right-sidebar set vault --no-focus cmux right-sidebar mode
ko: 사용법: cmux right-sidebar <command> [flags] CLI에서 오른쪽 사이드바를 제어합니다. 명령어: toggle 오른쪽 사이드바 표시 여부 토글 show 오른쪽 사이드바 표시 hide 오른쪽 사이드바 숨기기 focus 현재 오른쪽 사이드바 모드에 포커스 지정 set <files|find|vault|sessions|feed|dock|cloud|custom> [sidebar-name] 표시, 모드 전환 및 포커스 지정. `custom`은 ~/.config/cmux/sidebars의 JS/Swift 사이드바를 오른쪽 패널로 렌더링하며, 선택 사항인 이름으로 대상을 선택합니다. mode {"visible":bool,"mode":string} 출력 files|find|vault|sessions|feed|dock|cloud|custom show + set + focus의 별칭 플래그: --workspace <id|ref|index> 작업 공간을 포함하는 창을 대상으로 지정 --window <id|ref|index> 창을 대상으로 지정 --no-focus set 사용 시 포커스를 이동하지 않고 모드 전환 예시: cmux right-sidebar toggle cmux right-sidebar set find cmux right-sidebar set vault --no-focus cmux right-sidebar mode
zh_hans: 用法：cmux right-sidebar <command> [flags] 从 CLI 控制右侧边栏。 命令: toggle 切换右侧边栏的显示与隐藏 show 显示右侧边栏 hide 隐藏右侧边栏 focus 聚焦当前的右侧边栏模式 set <files|find|vault|sessions|feed|dock|cloud|custom> [sidebar-name] 显示、切换模式并聚焦。`custom` 会把 ~/.config/cmux/sidebars 中的 JS/Swift 侧边栏 渲染为右侧面板；可选的名称用于指定其中一个。 mode 打印 {"visible":bool,"mode":string} files|find|vault|sessions|feed|dock|cloud|custom show + set + focus 的别名 标志: --workspace <id|ref|index> 指向包含该工作区的窗口 --window <id|ref|index> 指向某个窗口 --no-focus 与 set 同用时，只切换模式不移动焦点 示例: cmux right-sidebar toggle cmux right-sidebar set find cmux right-sidebar set vault --no-focus cmux right-sidebar mode
zh_hant: 用法：cmux right-sidebar <command> [flags] 從 CLI 控制右側邊欄。 指令： toggle 切換右側邊欄可見性 show 顯示右側邊欄 hide 隱藏右側邊欄 focus 聚焦至目前的右側邊欄模式 set <files|find|vault|sessions|feed|dock|cloud|custom> [sidebar-name] 顯示、切換模式並聚焦。`custom` 會將 來自 ~/.config/cmux/sidebars 的 JS/Swift 側邊欄 轉譯為右側面板；選用名稱可選擇其中一個。 mode 列印 {"visible":bool,"mode":string} files|find|vault|sessions|feed|dock|cloud|custom show + set + focus 的別名 旗標： --workspace <id|ref|index> 以包含工作區的視窗為目標 --window <id|ref|index> 以視窗為目標 --no-focus 搭配 set 使用時，切換模式但不移動焦點 範例： cmux right-sidebar toggle cmux right-sidebar set find cmux right-sidebar set vault --no-focus cmux right-sidebar mode

# cli.send.queuedSuffix
source: queued (terminal starting; input will be sent when its PTY is ready)
ar: في الانتظار (بدء تشغيل الطرفية؛ سيتم إرسال المدخلات عندما تكون الـ PTY جاهزة)
de: in der Warteschlange (Terminal startet; Eingabe wird gesendet, wenn sein PTY bereit ist)
es: en cola (iniciando terminal; la entrada se enviará cuando su PTY esté lista)
fr: en file d'attente (terminal en cours de démarrage ; la saisie sera envoyée dès que son PTY sera prêt)
ja: キュー済み（ターミナル起動中。PTY 生成後に入力が送信されます）
ko: 대기 중 (터미널 시작 중, PTY가 준비되면 입력이 전송됩니다)
zh_hans: 已排队（终端正在启动；PTY 就绪后会发送输入）
zh_hant: 已排入佇列 (終端機啟動中；將在其 PTY 就緒時傳送輸入)

# cli.sessions.error.agentRequiresValue
source: sessions list: --agent requires a value
ar: قائمة الجلسات: يتطلب الخيار --agent قيمة
de: sessions list: --agent erfordert einen Wert
es: sessions list: --agent requiere un valor
fr: sessions list : --agent requiert une valeur
ja: sessions list: --agent には値が必要です
ko: sessions list: --agent에 값이 필요합니다
zh_hans: sessions list：--agent 需要一个值
zh_hant: sessions list: --agent 需要一個值

# cli.sessions.error.invalidLimit
source: sessions list: --limit must be a positive integer
ar: قائمة الجلسات: يجب أن يكون الخيار --limit عددًا صحيحًا موجبًا
de: sessions list: --limit muss eine positive Ganzzahl sein
es: sessions list: --limit debe ser un entero positivo
fr: sessions list : --limit doit être un entier positif
ja: sessions list: --limit には正の整数を指定してください
ko: sessions list: --limit은 양의 정수여야 합니다
zh_hans: sessions list：--limit 必须是正整数
zh_hant: sessions list: --limit 必須為正整數

# cli.sessions.error.unexpectedArgument
source: sessions list: unexpected argument '%@'
ar: قائمة الجلسات: وسيط غير متوقع '%@'
de: sessions list: unerwartetes Argument „%@“
es: sessions list: argumento inesperado '%@'
fr: sessions list : argument inattendu '%@'
ja: sessions list: 予期しない引数 '%@'
ko: sessions list: 예기치 않은 인수 '%@'
zh_hans: sessions list：意外参数 '%@'
zh_hant: sessions list: 未預期的引數 '%@'

# cli.sessions.error.unknownAgent
source: sessions list: unknown agent '%@'
ar: قائمة الجلسات: وكيل غير معروف '%@'
de: sessions list: unbekannter Agent „%@“
es: sessions list: agente desconocido '%@'
fr: sessions list : agent inconnu '%@'
ja: sessions list: 不明なエージェント '%@'
ko: sessions list: 알 수 없는 에이전트 '%@'
zh_hans: sessions list：未知代理 '%@'
zh_hant: sessions list: 未知的代理程式 '%@'

# cli.sessions.error.unknownFlag
source: sessions list: unknown flag '%@'
ar: قائمة الجلسات: علم غير معروف '%@'
de: sessions list: unbekanntes Flag „%@“
es: sessions list: opción desconocida '%@'
fr: sessions list : option inconnue '%@'
ja: sessions list: 不明なフラグ '%@'
ko: sessions list: 알 수 없는 플래그 '%@'
zh_hans: sessions list：未知标志 '%@'
zh_hant: sessions list: 未知的旗標 '%@'

# cli.sessions.error.unknownSubcommand
source: Unknown sessions subcommand: %@. Usage: cmux sessions list [options]
ar: أمر فرعي غير معروف للجلسات: %@. الاستخدام: cmux sessions list [options]
de: Unbekannter sessions-Unterbefehl: %@. Verwendung: cmux sessions list [Optionen]
es: Subcomando de sessions desconocido: %@. Uso: cmux sessions list [options]
fr: Sous-commande sessions inconnue : %@. Utilisation : cmux sessions list [options]
ja: 不明な sessions サブコマンドです: %@。使用方法: cmux sessions list [options]
ko: 알 수 없는 sessions 하위 명령어: %@. 사용법: cmux sessions list [options]
zh_hans: 未知的 sessions 子命令：%@。用法：cmux sessions list [options]
zh_hant: 未知的 sessions 子指令：%@。用法：cmux sessions list [options]

# cli.sessions.output.more
source: ... %lld more. Pass --all or --limit <n>.
ar: ... %lld جلسة أخرى. مرر --all أو --limit <n>.
de: ... %lld weitere. Geben Sie --all oder --limit <n> an.
es: ... %lld más. Pasa --all o --limit <n>.
fr: ... %lld de plus. Passez --all ou --limit <n>.
ja: ... 他に %lld 件あります。--all または --limit <n> を指定してください。
ko: ... %lld개 더 있습니다. --all 또는 --limit <n>을 지정하세요.
zh_hans: ... 还有 %lld 个。请传入 --all 或 --limit <n>。
zh_hant: ... 還有 %lld 個。請傳遞 --all 或 --limit <n>。

# cli.sessions.output.noMatches
source: No saved agent sessions matched.
ar: لا توجد جلسات وكيل محفوظة مطابقة.
de: Keine gespeicherten Agenten-Sitzungen stimmten überein.
es: No coincidió ninguna sesión de agente guardada.
fr: Aucune session d'agent enregistrée ne correspond.
ja: 一致する保存済みエージェントセッションはありません。
ko: 일치하는 저장된 에이전트 세션이 없습니다.
zh_hans: 没有匹配的已保存代理会话。
zh_hant: 無相符的已儲存代理程式工作階段。

# cli.sessions.usage
source: Usage: cmux sessions list [options] cmux sessions [options] Print saved agent session records from ~/.cmuxterm/*-hook-sessions.json. This command does not require a running cmux socket. By default, broad output shows active, restorable, or transcript-backed records. Pass --all to inspect every saved hook record. Options: --agent <name> Filter to one agent, for example codex or claude --session <id> Filter to one agent session id --workspace <id> Filter to one saved workspace id --surface <id> Filter to one saved surface id --cwd <text> Filter by saved cwd or launch working directory --state-dir <path> Override hook state directory --codex-home <path> Override the default Codex home used for transcript checks --limit <n> Limit text output (default: 100) --all Print all matches --json Print structured JSON Codex rows include whether the saved id exists in CODEX_HOME/session_index.jsonl and whether a matching transcript file exists under CODEX_HOME/sessions or CODEX_HOME/archived_sessions. Compatibility aliases: cmux sessions debug [options] cmux session-debug [options]
ar: الاستخدام: cmux sessions list [options] cmux sessions [options] طباعة سجلات جلسات الوكيل المحفوظة من ~/.cmuxterm/*-hook-sessions.json. لا يتطلب هذا الأمر مقبس cmux نشط. بشكل افتراضي، يعرض المخرج العام السجلات النشطة، أو القابلة للاستعادة، أو المدعومة بنسخة مكتوبة (transcript-backed). مرر --all لفحص كل سجل خطاف محفوظ. الخيارات: --agent <name> التصفية لوكيل واحد، على سبيل المثال codex أو claude --session <id> التصفية لمعرف جلسة وكيل واحد --workspace <id> التصفية لمعرف مساحة عمل محفوظة واحدة --surface <id> التصفية لمعرف سطح محفوظ واحد --cwd <text> التصفية حسب دليل العمل الحالي المحفوظ (cwd) أو دليل العمل المستهدف للتشغيل --state-dir <path> تجاوز دليل حالة الخطاف --codex-home <path> تجاوز مسار Codex الرئيسي الافتراضي المستخدم لفحوصات النسخة المكتوبة --limit <n> تحديد كمية المخرجات النصية (الافتراضي: 100) --all طباعة كافة التطابقات --json طباعة JSON منظم تتضمن صفوف Codex ما إذا كان المعرف المحفوظ موجودًا في CODEX_HOME/session_index.jsonl وما إذا كان ملف نسخة مكتوبة مطابقة موجودًا تحت CODEX_HOME/sessions أو CODEX_HOME/archived_sessions. الأسماء المستعارة للتوافق: cmux sessions debug [options] cmux session-debug [options]
de: Verwendung: cmux sessions list [Optionen] cmux sessions [Optionen] Gespeicherte Agenten-Sitzungsdatensätze aus ~/.cmuxterm/*-hook-sessions.json ausgeben. Dieser Befehl erfordert kein laufendes cmux-Socket. Standardmäßig zeigt die ausführliche Ausgabe aktive, wiederherstellbare oder durch ein Transkript gesicherte Datensätze an. Übergeben Sie --all, um jeden gespeicherten Hook-Datensatz zu untersuchen. Optionen: --agent <name> Auf einen Agenten filtern, zum Beispiel codex oder claude --session <id> Auf eine Agenten-Sitzungs-ID filtern --workspace <id> Auf eine gespeicherte Arbeitsbereichs-ID filtern --surface <id> Auf eine gespeicherte Oberflächen-ID filtern --cwd <text> Nach gespeicherter cwd oder dem Start-Arbeitsverzeichnis filtern --state-dir <path> Hook-Statusverzeichnis überschreiben --codex-home <path> Das für Transkriptprüfungen verwendete Standard-Codex-Home überschreiben --limit <n> Textausgabe begrenzen (Standard: 100) --all Alle Treffer ausgeben --json Strukturiertes JSON ausgeben Codex-Zeilen enthalten Angaben darüber, ob die gespeicherte ID in CODEX_HOME/session_index.jsonl existiert und ob eine passende Transkriptdatei unter CODEX_HOME/sessions oder CODEX_HOME/archived_sessions existiert. Kompatibilitäts-Aliase: cmux sessions debug [Optionen] cmux session-debug [Optionen]
es: Uso: cmux sessions list [options] cmux sessions [options] Imprimir los registros de sesiones de agentes guardados desde ~/.cmuxterm/*-hook-sessions.json. Este comando no requiere un socket de cmux en ejecución. Por defecto, la salida general muestra registros activos, restaurables o respaldados por transcripciones. Pase --all para inspeccionar cada registro de hook guardado. Opciones: --agent <name> Filtrar por un agente, por ejemplo codex o claude --session <id> Filtrar por un ID de sesión de agente --workspace <id> Filtrar por un ID de espacio de trabajo guardado --surface <id> Filtrar por un ID de superficie guardado --cwd <text> Filtrar por el cwd guardado o el directorio de trabajo de inicio --state-dir <path> Sobrescribir el directorio de estado del hook --codex-home <path> Sobrescribir el Codex home predeterminado utilizado para comprobaciones de transcripción --limit <n> Limitar la salida de texto (por defecto: 100) --all Imprimir todas las coincidencias --json Imprimir JSON estructurado Las filas de Codex incluyen si el id guardado existe en CODEX_HOME/session_index.jsonl y si existe un archivo de transcripción coincendente en CODEX_HOME/sessions o CODEX_HOME/archived_sessions. Alias de compatibilidad: cmux sessions debug [options] cmux session-debug [options]
fr: Utilisation : cmux sessions list [options] cmux sessions [options] Afficher les enregistrements de session d'agent sauvegardés depuis ~/.cmuxterm/*-hook-sessions.json. Cette commande ne requiert pas de socket cmux en cours d'exécution. Par défaut, l'affichage détaillé présente les enregistrements actifs, restaurables ou sauvegardés par transcription. Passez --all pour inspecter chaque enregistrement de hook sauvegardé. Options : --agent <nom> Filtrer par agent, par exemple codex ou claude --session <id> Filtrer par identifiant de session d'agent --workspace <id> Filtrer par identifiant d'espace de travail sauvegardé --surface <id> Filtrer par identifiant de surface d’affichage sauvegardé --cwd <texte> Filtrer par cwd sauvegardé ou par répertoire de travail de lancement --state-dir <chemin> Surcharger le répertoire d'état du hook --codex-home <chemin> Surcharger le répertoire personnel Codex par défaut utilisé pour les vérifications de transcription --limit <n> Limiter l'affichage textuel (par défaut : 100) --all Afficher toutes les correspondances --json Afficher au format JSON structuré Les lignes Codex indiquent si l'identifiant sauvegardé existe dans CODEX_HOME/session_index.jsonl et si un fichier de transcription correspondant existe sous CODEX_HOME/sessions ou CODEX_HOME/archived_sessions. Alias de compatibilité : cmux sessions debug [options] cmux session-debug [options]
ja: 使用方法: cmux sessions list [options] cmux sessions [options] ~/.cmuxterm/*-hook-sessions.json から保存済みエージェントセッション記録を表示します。 このコマンドは実行中の cmux ソケットを必要としません。 既定では、広範な出力にはアクティブ、復元可能、またはトランスクリプト付きの記録だけを表示します。 保存済みフック記録をすべて確認するには --all を指定します。 オプション: --agent <name> 1 つのエージェントに絞り込みます。例: codex または claude --session <id> 1 つのエージェントセッション ID に絞り込みます --workspace <id> 保存済みワークスペース ID に絞り込みます --surface <id> 保存済みサーフェス ID に絞り込みます --cwd <text> 保存済み cwd または起動時の作業ディレクトリで絞り込みます --state-dir <path> フック状態ディレクトリを上書きします --codex-home <path> トランスクリプト確認に使う既定の Codex ホームを上書きします --limit <n> テキスト出力の件数を制限します（既定: 100） --all すべての一致を表示します --json 構造化 JSON を出力します Codex 行には、保存済み ID が CODEX_HOME/session_index.jsonl に存在するか、 一致するトランスクリプトファイルが CODEX_HOME/sessions または CODEX_HOME/archived_sessions に存在するかが含まれます。 互換エイリアス: cmux sessions debug [options] cmux session-debug [options]
ko: 사용법: cmux sessions list [options] cmux sessions [options] ~/.cmuxterm/*-hook-sessions.json에서 저장된 에이전트 세션 기록을 출력합니다. 이 명령어는 실행 중인 cmux 소켓을 필요로 하지 않습니다. 기본적으로 전체 출력은 활성, 복구 가능 또는 트랜스크립트 기반 기록을 보여줍니다. 모든 저장된 훅 기록을 검사하려면 --all을 전달하세요. 옵션: --agent <name> 특정 에이전트(예: codex 또는 claude)로 필터링 --session <id> 특정 에이전트 세션 ID로 필터링 --workspace <id> 특정 저장된 작업 공간 ID로 필터링 --surface <id> 특정 저장된 화면 ID로 필터링 --cwd <text> 저장된 cwd 또는 실행 작업 디렉토리로 필터링 --state-dir <path> 훅 상태 디렉토리 재정의 --codex-home <path> 트랜스크립트 검사에 사용되는 기본 Codex 홈 재정의 --limit <n> 텍스트 출력 제한 (기본값: 100) --all 모든 일치 항목 출력 --json 구조화된 JSON 출력 Codex 행에는 저장된 ID가 CODEX_HOME/session_index.jsonl에 존재하는지 여부와 일치하는 트랜스크립트 파일이 CODEX_HOME/sessions 또는 CODEX_HOME/archived_sessions 아래에 존재하는지 여부가 포함됩니다. 호환성 별칭: cmux sessions debug [options] cmux session-debug [options]
zh_hans: 用法：cmux sessions list [options] cmux sessions [options] 输出 ~/.cmuxterm/*-hook-sessions.json 中保存的代理会话记录。 此命令不需要正在运行的 cmux socket。 默认情况下，宽泛输出会显示活动的、可恢复的或有转写记录支撑的记录。 传入 --all 可查看每一条已保存的 hook 记录。 选项: --agent <name> 仅筛选一个代理，例如 codex 或 claude --session <id> 仅筛选一个代理会话 id --workspace <id> 仅筛选一个已保存的工作区 id --surface <id> 仅筛选一个已保存的表面 id --cwd <text> 按已保存的 cwd 或启动工作目录筛选 --state-dir <path> 覆盖 hook 状态目录 --codex-home <path> 覆盖用于转写检查的默认 Codex home --limit <n> 限制文本输出（默认：100） --all 输出所有匹配项 --json 输出结构化 JSON Codex 行会显示已保存的 id 是否存在于 CODEX_HOME/session_index.jsonl， 以及在 CODEX_HOME/sessions 或 CODEX_HOME/archived_sessions 下 是否存在匹配的转写文件。 兼容别名: cmux sessions debug [options] cmux session-debug [options]
zh_hant: 用法：cmux sessions list [options] cmux sessions [options] 從 ~/.cmuxterm/*-hook-sessions.json 列印已儲存的代理程式工作階段紀錄。 此指令不需要執行中的 cmux socket。 預設情況下，寬格式輸出會顯示作用中、可還原或有逐字稿備份的紀錄。 傳遞 --all 以檢查每個儲存的勾點紀錄。 選項： --agent <name> 篩選單一代理程式，例如 codex 或 claude --session <id> 篩選單一代理程式工作階段 id --workspace <id> 篩選單一已儲存的工作區 id --surface <id> 篩選單一已儲存的介面 id --cwd <text> 依已儲存的 cwd 或啟動工作目錄進行篩選 --state-dir <path> 覆寫勾點狀態目錄 --codex-home <path> 覆寫用於逐字稿檢查的預設 Codex 家目錄 --limit <n> 限制文字輸出 (預設值：100) --all 列印所有相符項 --json 列印結構化 JSON Codex 資料列包含儲存的 id 是否存在於 CODEX_HOME/session_index.jsonl 中，以及 CODEX_HOME/sessions 或 CODEX_HOME/archived_sessions 下是否存在相符的逐字稿檔案。 相容性別名： cmux sessions debug [options] cmux session-debug [options]

# cli.sidebar.error.allWithName
source: sidebar %@: use either --all or a sidebar name, not both
ar: sidebar %@: استخدم إما --all أو اسم الشريط الجانبي، وليس كليهما
de: sidebar %@: Verwenden Sie entweder --all oder einen Seitenleisten-Namen, nicht beides
es: sidebar %@: use --all o un nombre de barra lateral, no ambos
fr: sidebar %@ : utilisez soit --all soit un nom de barre latérale, mais pas les deux
ja: sidebar %@: --all またはサイドバー名のどちらか一方を指定してください
ko: sidebar %@: --all과 사이드바 이름 중 하나만 사용해야 하며, 둘 다 사용할 수 없습니다
zh_hans: sidebar %@：请使用 --all 或某个 sidebar 名称，不能同时使用
zh_hant: sidebar %@：請使用 --all 或側邊欄名稱，而非兩者皆用

# cli.sidebar.error.missingCommand
source: sidebar requires a subcommand: validate, reload, select, or open
ar: يتطلب الشريط الجانبي أمرًا فرعيًا: validate، أو reload، أو select، أو open
de: Seitenleiste erfordert einen Unterbefehl: validate, reload, select oder open
es: sidebar requiere un subcomando: validate, reload, select o open
fr: barre latérale requiert une sous-commande : validate, reload, select ou open
ja: sidebar にはサブコマンド validate、reload、select、open のいずれかが必要です
ko: sidebar에는 하위 명령어가 필요합니다: validate, reload, select 또는 open
zh_hans: sidebar 需要一个子命令：validate、reload、select 或 open
zh_hant: sidebar 需要子指令：validate、reload、select 或 open

# cli.sidebar.error.namedActionAll
source: sidebar %@ does not support --all
ar: الشريط الجانبي %@ لا يدعم --all
de: sidebar %@ unterstützt --all nicht
es: sidebar %@ no admite --all
fr: sidebar %@ ne prend pas en charge --all
ja: sidebar %@ は --all をサポートしていません
ko: sidebar %@은(는) --all을 지원하지 않습니다
zh_hans: sidebar %@ 不支持 --all
zh_hant: sidebar %@ 不支援 --all

# cli.sidebar.error.namedActionRequiresName
source: sidebar %@ requires one sidebar name
ar: يتطلب الشريط الجانبي %@ اسم شريط جانبي واحد
de: sidebar %@ erfordert einen Seitenleisten-Namen
es: sidebar %@ requiere un nombre de barra lateral
fr: sidebar %@ requiert un nom de barre latérale
ja: sidebar %@ にはサイドバー名が 1 つ必要です
ko: sidebar %@은(는) 하나의 사이드바 이름이 필요합니다
zh_hans: sidebar %@ 需要一个 sidebar 名称
zh_hant: sidebar %@ 需要一個側邊欄名稱

# cli.sidebar.error.selectAll
source: sidebar select does not support --all
ar: تحديد الشريط الجانبي لا يدعم --all
de: sidebar select unterstützt --all nicht
es: sidebar select no admite --all
fr: sidebar select ne prend pas en charge --all
ja: sidebar select は --all をサポートしていません
ko: sidebar select는 --all을 지원하지 않습니다
zh_hans: sidebar select 不支持 --all
zh_hant: sidebar select 不支援 --all
